Repository: KirilToshev/PieceOfCake
Catalog: PieceOfCake.Core/Common/Resources/UserErrors.*.resx
Languages: bg_bg

# DescriptionExceedsMaxLength
source: {0} description should not exceed {1} symbols.
bg_bg: Описанието на {0} трябва да бъде не по-малко от {1} символа.

# DescriptionIsMandatory
source: {0} must have description.
bg_bg: Описанието на {0} е задължително.

# DishMustHaveIngredients
source: A Dish must have at least one or more ingredients.
bg_bg: Ястието трябва да има едина или повече съставки.

# DishMustHaveMenuOfTheDayType
source: A dish must have assigned at least one menu of the day type. (Breakfast, Lunch, Dinner, etc...)
bg_bg: Ястието трябва да има поне един тип хранене от деня. (Закуска, обяд, вечеря ... )

source: End Date is mandatory.
bg_bg: Крайна дата е задължителна.

# IdNotFound
source: Element with Id={0} does not exists.
bg_bg: Елемент с идентификационен номер={0} не съществува.

# IngredientAlreadyExists
source: There should be no product duplicates in the current dish. Check your products in the ingredients list.
bg_bg: Ястието не трябва да съдържа дуплицирани продукти. Моля проверете продуктите от списъка със съставките.

# InvalidStateTransition
source: Transition between state {0} and state {1} is invalid.
bg_bg: Преминаване от състояние {0} към състояние {1} е невалидно.

# ItemIsInUse
source: {0} can't be deleted, because it is still being used.
bg_bg: {0} не може да бъде изтрит поради съществуваща употреба.

# MealOfTheDayTypeAlreadyExists
source: Meals of the day must be unique.
bg_bg: Типовете на хранене от деня трябва да бъдат уникални.

# MenuMustHaveAtleastOnePerson
source: Menu should have one or more people.
bg_bg: Менюто трябва да е съставено за един или повече човека.

# MenuMustHaveAtLeastOneServing
source: It is impossible to have a menu without at least one meal type.
bg_bg: Невъзможно е създаване на меню без минимум една порция за ден.

# NameAlreadyExists
source: An entity with name {0} already exist.
bg_bg: Запис с име {0} вече съществува.

# NameBelowMinLength
source: {0} name should be more than {1} symbols.
bg_bg: Името на {0} трябва да бъде не по-малко от {1} символа.

# NameExceedsMaxLength
source: {0} name should not exceed {1} symbols.
bg_bg: Името на {0} не трябва да надвишава {1} символа.

# NameIsMandatory
source: {0} must have name.
bg_bg: {0} трябва има да име.

# NotEnoughDishesOfMenuType
source: There are not enough dishes of menu type {0} to complete your menu.
bg_bg: Не съществуват достатъчен брой ястия от тип {0} за създаването на вашето меню.

# PeriodStartDateLaterThanEndDate
source: Start Date {0} of a time period must be less than its End Date {1}
bg_bg: Стартовата дата {0} на времевия период трябва да е по-малка от крайната {1}

# QuantityMustBeGraterThanZero
source: Quantity value must be grater than zero.
bg_bg: Количеството трябва да надвишава 0.

source: Sequence contains no elements.
bg_bg: Съдържанието на колекцията е празно.

# ServingSizeMustBeGraterThanOne
source: There should be at least one or more servings in a dish.
bg_bg: Ястието трябва да има поне една порция.

# ServingSizeMustBeLessThanByteLimit
source: Dish can not have more than {0} servings.
bg_bg: Ястието не може да превишава {0} порции.

source: Start Date is mandatory.
bg_bg: Стартова дата е задължителна.
